{"columns":["title","preview"],"index":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14],"data":[["Two of a Space Kind: Apollo 12 and Mars 2020","Apollo 12 and the upcoming Mars 2020 mission may be separated by half a century, but they share several goals unique in the annals of space exploration."],["How NASA's Mars Helicopter Will Reach the Red Planet's Surface","The small craft will seek to prove that powered, controlled flight is possible on another planet. But just getting it onto the surface of Mars will take a whole lot of ingenuity."],["NASA's Curiosity Keeps Rolling As Team Operates Rover From Home","The team has learned to meet new challenges as they work remotely on the Mars mission."],["NASA's Mars Perseverance Rover Passes Flight Readiness Review","​The agency's Mars 2020 mission has one more big prelaunch review – the Launch Readiness Review, on July 27."],["NASA to Hold Mars 2020 Perseverance Rover Launch Briefing","Learn more about the agency's next Red Planet mission during a live event on June 17."],["NASA to Broadcast Mars 2020 Perseverance Launch, Prelaunch Activities","Starting July 27, news activities will cover everything from mission engineering and science to returning samples from Mars to, of course, the launch itself."],["Air Deliveries Bring NASA's Perseverance Mars Rover Closer to Launch","A NASA Wallops Flight Facility cargo plane transported more than two tons of equipment — including the rover's sample collection tubes — to Florida for this summer's liftoff."],["NASA's Perseverance Rover Will Carry First Spacesuit Materials to Mars","In a Q&A, spacesuit designer Amy Ross explains how five samples, including a piece of helmet visor, will be tested aboard the rover, which is targeting a July 30 launch. "],["Two Rovers to Roll on Mars Again: Curiosity and Mars 2020","They look like twins. But under the hood, the rover currently exploring the Red Planet and the one launching there this summer have distinct science tools and roles to play."],["NASA Moves Forward With Campaign to Return Mars Samples to Earth","During this next phase, the program will mature critical technologies and make critical design decisions as well as assess industry partnerships."],["NASA's Treasure Map for Water Ice on Mars","A new study identifies frozen water just below the Martian surface, where astronauts could easily dig it up."],["Curiosity Mars Rover's Summer Road Trip Has Begun","After more than a year in the \"clay-bearing unit,\" Curiosity is making a mile-long journey around some deep sand so that it can explore higher up Mount Sharp."],["Hear Audio From NASA's Perseverance As It Travels Through Deep Space","The first to be rigged with microphones, the agency's latest Mars rover picked up the subtle sounds of its own inner workings during interplanetary flight."],["NASA's Perseverance Rover Attached to Atlas V Rocket","Ready for its launch later in the month, the Mars-bound rover will touch terra firma no more."],["NASA's Perseverance Rover Goes Through Trials by Fire, Ice, Light and Sound","The agency's new Mars rover is put through a series of tests in vacuum chambers, acoustic chambers and more to get ready for the Red Planet."]]}